/********* ProfileViewController *********/

/* Back button, user details */
"Profile.BackButton" = " Back";

/********* BucketContentCollectionViewController *********/

/* BucketContentCollectionView, empty data set view */
"BucketContent.EmptyData.FirstLocalizedString" = "Add some shots\nto this bucket ";

/* BucketContentCollectionView, empty data set view */
"BucketContent.EmptyData.LastLocalizedString" = " first!";

/********* LikesCollectionViewController *********/

/* LikesCollectionView, empty data set view */
"LikesCollectionView.EmptyData.FirstLocalizedString" = "Like ";

/* LikesCollectionView, empty data set view */
"LikesCollectionView.EmptyData.LastLocalizedString" = " some shots first!";

/********* FolloweesCollectionViewController *********/

/* FolloweesCollectionView, empty data set view */
"FolloweesCollectionView.EmptyData.FirstLocalizedString" = " Follow ";

/* FolloweesCollectionView, empty data set view */
"FolloweesCollectionView.EmptyData.LastLocalizedString" = " someone first!";

/********* FolloweesViewModel *********/

/* Title of Following screen */
"FolloweesViewModel.Title" = "Following";

//******** LikesViewModel ********

/* Title of Likes screen */
"LikesViewModel.Title" = "Likes";

/********* CenterButtonTabBarController *********/

/* Main view, bottom bar */
"CenterButtonTabBar.Likes" = "Likes";

/* Main view, bottom bar */
"CenterButtonTabBar.Buckets" = "Buckets";

/* Main view, bottom bar */
"CenterButtonTabBar.Following" = "Following";

/* Main view, bottom bar */
"CenterButtonTabBar.Settings" = "Settings";

/********* AcknowledgementsViewController *********/

/* Acknowledgements view title*/
"AcknowledgementsView.Title" = "Acknowledgements";

/* Back button */
"AcknowledgementsView.Back" = "Back";

/********* BucketsCollectionViewController *********/

/* Button for adding new bucket */
"BucketsCollectionView.AddNew" = "Add New";

/* Displayed when empty data in view */
"BucketsCollectionViewController.EmptyData.FirstLocalizedString" = "Add some shots\nto buckets ";

/* Displayed when empty data in view. */
"BucketsCollectionViewController.EmptyData.LastLocalizedString" = " first!";

/* Displayed when creating new bucket fails. */
"BucketsCollectionViewController.NewBucketFail" = "Unable to create new bucket";

/********* ShotBucketsViewModel *********/

/* Allows user to add shot to bucket */
"ShotBucketsViewModel.AddToBucket" = "Add to Bucket";

/* Allows user to remove shot from bucket */
"ShotBucketsViewModel.RemoveFromBucket" = "Remove from Bucket";

/* Allows user to create new bucket */
"ShotBucketsViewModel.NewBucket" = "New Bucket";

/* Allows user to remove from multiple buckets */
"ShotBucketsViewModel.RemoveFromSelectedBuckets" = "Remove from Selected Buckets";

/********* Responsable *********/

/* Visible when user authorization expired. */
"Responsable.AuthorizationExpired" = "Authorization expired. Please log in again.";

/* Visible when failed to retrieve data. */
"Responsable.RetrievingFailed" = "Failed retrieving data";

/********* ShotDetailsFormatter *********/

/* Preposition describing author of shot. */
"ShotDetailsFormatter.By" = "by";

/* Preposition describing for who shot was made. */
"ShotDetailsFormatter.For" = "for";

/* Preposition describing when shot was made. */
"ShotDetailsFormatter.On" = "on";

/********* ShotDetailsViewController *********/

/* Title of email with abusive content. */
"ShotDetailsViewController.Inappropriate" = "Inappropriate content!";

/* Error while adding/removing shot to bucket. */
"ShotDetailsViewController.BucketError" = "Oh no! We are unable to process your buckets right now. Try again in a while.";

/* Error while removing comment. */
"ShotDetailsViewController.RemovingCommentError" = "Oh no! We are unable to delete comment right now. Try again in a while.";

/* Error while adding comment. */
"ShotDetailsViewController.AddingCommentError" = "Oh no! We are unable to add comment right now. Try again in a while.";

/********* CommentEditView *********/

/* Mark selected comment as liked. */
"CommentEditView.Like" = "Like";

/* Cancel editing comment. */
"CommentEditView.Cancel" = "Cancel";

/* Editing comment, delete. */
"CommentEditView.Delete" = "Delete";

/* Editing comment, report. */
"CommentEditView.Report" = "Report";

/********* UIAlertControllerExtension *********/

/* Allows user to create new bucket. */
"UIAlertControllerExtension.NewBucket" = "New Bucket";

/* Asks user to provide name for bucket */
"UIAlertControllerExtension.ProvideName" = "Provide name for new bucket";

/* Cancel creating new bucket. */
"UIAlertControllerExtension.Cancel" = "Cancel";

/* Create new bucket. */
"UIAlertControllerExtension.Create" = "Create";

/* Asks user to enter bucket name. */
"UIAlertControllerExtension.BucketName" = "Enter bucket's name:";

/* General popup informing about error. */
"UIAlertControllerExtension.Error" = "Error occurred";

/* Allows user to try again after error occurred. */
"UIAlertControllerExtension.TryAgain" = "Try again in a while.";

/* OK */
"UIAlertControllerExtension.OK" = "OK";

/* Dismiss */
"UIAlertControllerExtension.Dismiss" = "Dismiss";

/* Inappropriate content has been reported. */
"UIAlertControllerExtension.InappropriateContentReported" = "Inappropriate content has been reported. Verification and blocking will take up to \n 24 hours.";

/* Displayed when user device is not capable of/configured to send emails. */
"UIAlertControllerExtension.EmailError" = "We cannot send the email with your report about abusive content because no configured email account has been found.";

/* Displayed when user device is not capable of/configured to send emails, shown when trying to send feedback. */
"UIAlertControllerExtension.CantSendFeedback" = "Don't have email client - no worries use this address to send us feedback elsewhere: inbbbox@netguru.co";

/* Informing user about problems with downloading items. */
"UIAlertControllerExtension.UnableToDownload" = "Downloading new Dribbble shots";

/********* LocalNotificationRegistrator *********/

/* Text of notification encouraging user to use app */
"LocalNotificationRegistrator.AlertBody" = "Check Inbbbox for a daily dose of design shots";

/* Action for notification */
"LocalNotificationRegistrator.Show" = "Show";

/********* SettingsViewModel *********/

/* Title for account screen */
"SettingsViewModel.Account" = "Account & Settings";

/* Button text allowing user to create new account. */
"SettingsViewModel.CreateAccount" = "Create Dribbble Account";

/* User settings, show debuts */
"SettingsViewModel.Debuts" = "Debuts";

/* User settings, enable daily reminders */
"SettingsViewModel.EnableDailyReminders" = "Enable daily reminder";

/* User settings, enable new today. */
"SettingsViewModel.NewToday" = "New Today";

/* User settings, enable popular today. */
"SettingsViewModel.Popular" = "Popular Today";

/* User settings, send daily reminders */
"SettingsViewModel.SendDailyReminders" = "Send daily reminder at";

/* User settings, enable following */
"SettingsViewModel.Following" = "Following";

/* Notifications alert, dismiss button. */
"SettingsViewModel.Dismiss" = "Dismiss";

/* Title of alert, asking user to grant notifications permission. */
"SettingsViewModel.Permissions" = "Permissions";

/* Redirect user to Settings app */
"SettingsViewModel.Settings" = "Settings";

/* User Settings, show author. */
"SettingsViewModel.DisplayAuthor" = "Show Author on Homescreen";

/* Title of flash message, when user turn off all sources */
"SettingsViewModel.AllSources" = "With current settings you won't see any shots. Turn at least one stream source.";

/* User Setting, night mode */
"SettingsViewModel.NightMode" = "Night Mode";

/* User Settings, feedback section title. */
"SettingsViewModel.Feedback" = "FEEDBACK";

/* User Settings, send your feedback button. */
"SettingsViewModel.SendFeedback" = "Send us your suggestions";

/* User Settings, feedback sent. */
"SettingsViewModel.FeedbackSent" = "Thank you! Your Feedback has been sent!";

/********* Acknowledgements button *********/
"SettingsViewModel.AcknowledgementsButton" = "Acknowledgements";

/* Body of alert, asking user to grant notifications permission. */
"SettingsViewModel.AccessToNotifications" = "You have to give access to notifications.";

/********* SettingsViewController *********/

/* Title of group of buttons for stream source settings */
"SettingsViewController.StreamSource" = "INBBBOX STREAM SOURCE";

/********* Is user a guest without account? *********/
"SettingsViewController.Guest" = "Guest?";

/* Log out button */
"SettingsViewController.LogOut" = "Log Out";

/* Title of group of buttons for notifications settings */
"SettingsViewController.Notifications" = "NOTIFICATIONS";

/* Title of group of buttons for customization settings */
"SettingsViewController.Customization" = "CUSTOMIZATION";

/********* ShotsCollectionViewController *********/

/* Title of alert visible after upon error detection. */
"ShotsCollectionViewController.Error" = "Error occurred";

/* Message informing user will be logged out because of an error. */
"ShotsCollectionViewController.SignOut" = "Error occurred\nSigning out...";

/* Dismiss error alert. */
"ShotsCollectionViewController.Dismiss" = "Dismiss";

/* Error shown when no stream sources were selected. */
"ShotsCollectionViewController.NoShotsErrorLabel" = "Select at least 1 \nstream source \nin the settings";

/********** ProfileHeaderView *********/

/* Allows user to follow another user. */
"ProfileHeaderView.Follow" = "Follow";

/* Allows user to unfollow another user. */
"ProfileHeaderView.Unfollow" = "Unfollow";

/********* GifIndicatorView *********/

/* GIF file type. */
"GifIndicatorView.GIF" = "GIF";

/********* ORLoginLabel *********/

/* Visible as a text allowing user to choose login method. */
"ORLoginLabel.OR" = "OR";

/********* DatePickerViewController *********/

/* Button title when users accepts selected date for reminder. */
"DatePickerViewController.SetReminder" = "Set Reminder";

/********* CommentComposerView *********/

/* Placeholder text, for comment text field. */
"CommentComposerView.TypeComment" = "Type your comment";

/********* LoginView *********/

/* Title of log in button */
"LoginView.LoginButtonTitle" = "Login with Dribbble";

/* Title of guest button */
"LoginView.GuestButtonTitle" = "Use as guest";

/* Slogan */
"LoginView.Slogan" = "Each shot swipes";

/**/
"LoginView.Loading" = "LOADING...";

/* Describes copyright holder */
"LoginView.Copyright" = "Copyright (c) 2016 Netguru.co";

/********* EmptyDataSetLoadingView *********/

/* Loading view, when empty data */
"EmptyDataSetLoadingView.Loading" = "Loading...";

/********* ShotsOnboardingStateHandler *********/
/* Below (steps 1 - 3) is localization of Onboarding images contained in Images.xcassets*/
"ShotsOnboardingStateHandler.Onboarding-Step1" = "onboarding-step1-en";
"ShotsOnboardingStateHandler.Onboarding-Step2" = "onboarding-step2-en";
"ShotsOnboardingStateHandler.Onboarding-Step3" = "onboarding-step3-en";
"ShotsOnboardingStateHandler.Onboarding-Step4" = "onboarding-step4-en";
"ShotsOnboardingStateHandler.Onboarding-Step5" = "onboarding-step5-en";
"ShotsOnboardingStateHandler.Skip" = "Skip this step";

/********* ShotsCollectionBackgroundView *********/

"BackgroundView.ShowingYou" = "Showing you:";

/********* ShotCollectionCell *********/
"ShotCollectionCell.Like" = "Added to Likes!";
"ShotCollectionCell.Bucket" = "Liked & Added bucket!";
"ShotCollectionCell.Comment" = "Commenting…";
"ShotCollectionCell.Follow" = "Following author!";
